---
kind: method
id: M:Autodesk.Revit.DB.DeleteWorksetSettings.Dispose
source: html/27e3e91c-d184-b358-d2a3-ada77f5e70ee.htm
---
# Autodesk.Revit.DB.DeleteWorksetSettings.Dispose Method

Releases all resources used by the DeleteWorksetSettings

## Syntax (C#)
```csharp
public void Dispose()
```